dynamicFvMesh/undevelopedFvMesh/tutorial/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.25;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.4;

maxAlphaCo      0.4;

maxDeltaT       1;

libs            ("libOpenFOAM.so" "librigidBody6DoFMotion.so");

functions
(
    forces
    {
        type        forces;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libforces.so");
        
        outputControl   timeStep;
        outputInterval  1;

        patches     ( box );

        rhoInf      1.0;   

        CofR        (0 0 0);
    }
);

// ************************************************************************* //
